#1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
#შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

list = [1, 2, 3, 4, 5, 6]


list[2:3] = [10, 20, 30]








#2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
#შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].
fruit = ["apple", "banana", "cherry", "kiwi", "mango"]
fruit[:1] = ["pear", "plum"]
print(fruit)




#3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
#შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

word = ["a", "b", "c", "d", "e", "f"]

word[-3:] = ["x", "y", "z"]

print(word)




#4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
#შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].


color = ["red", "green", "blue", "yellow", "black", "white"]


color[1:] = ["purple", "orange"]
print(color)



# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

name = ["გიორგი" , "ირმა" , "საბა" ]


name[:] = ["red", "green", "blue", "yellow", "black", "white"]


# ===========================================

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

input = int(input("enter random number"))

if input % 2 == 1:
    print("this number is odd")

elif input % 2 == 0:
    print("number is even")

else:
    print("get out")


# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"


numbers = [5, 8, 13, 10, 7, 4] 

if numbers[2] % 2 == 0:  
    print("Even number")
else:
    print("Odd number")

# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

numbers = [12, 45, 67, 82, 54] 
last = numbers[-1]  

if last % 2 == 0 and last > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif last % 2 != 0 and last < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")

# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100

int = [1, 4, 5, 6, 7, 8, 98, 0, 2, ]

if int[4] % 2 == 0 or int[4] > 100:
    print("even or more than 100")

elif int[2] % 2 == 1 or int[2] < 100:
    print("odd or less than 100")
# ==============================================================

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 


text = "hello"
text2 = "World"

if text != text2:
    print("arari toli")
else:
    print("tolia")

