# # 1) შექმენით რიცხვებით სავსე სია, ამ სიიდან იპოვეთ და დაპრინტეთ მეორე ყველაზე დიდი რიცხვი, გამოიყენეთ for ციკლი.




# num = [1, 2, 3, 4, 5, 6, 77, 8 , 9]

# biggest = num[0]
# second_biggest = num[0]
# for i in num:
#     if i > biggest:

#         second_biggest  = biggest

#         biggest = i

#     elif i > second_biggest and i != biggest:

#         second_biggest = i

# print(second_biggest)







# 2) მომხმარებელს შემოატანინეთ წინადადება და დაითვალეთ თუ ამ წინადადებაში რამდენი სიტყვის სიგრძე არის 4-ზე მეტი, დაპრინტეთ ასეთი სიტყვების რაოდენობა, მაგალითად 4. გამოიყენეთ while ციკლი.



enter = input("enter sentence: ")

all = 0

i = 0

sigrdze = 0

while i < len(enter):
    if enter[i] != " ":
        sigrdze += 1
    
    else:
        if sigrdze > 4:
            all += 1
            sigrdze = 0

    i += 1

if sigrdze > 4:
    all += 1

print(all)

        
            













# 3) მომხმარებელს შემოატანინეთ სიტყვა და გაიგეთ ეს სიტყვა არის თუ არა პალინდრომი - ანუ ეს სიტყვა წინიდანაც და უკნიდანაც თუ ზუსტად იგივენაირად იკითხება. თუ კი მაშინ დაპრინტეთ True, თუ არა დაპრინტეთ False, გამოიყენეთ for ციკლი, არ გამოიყენოთ slicing - [::-1].


name = input("enter name:  ")

namee = ""


for i in name:
    namee = i + namee

print(namee)



    








# # 4) შექმენით არეული რიცხვებით სავსე გრძელი სია და 2 ცარიელი სია, ერთ სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და დგას კენტ ინდექსზე, ხოლო მეორე სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და დგას კენტ ინდექსზე, გამოიყენეთ for ციკლი.

# num1 = [123, 4325, 543, 1234, 344, 3244, 66, 23]

# pirveli = []  
# meore = []    

# for i in range(len(num1)):

#     if num1[i] % 2 == 0 and i % 2 == 1:

#         pirveli.append(num1[i])

#     elif num1[i] % 2 == 1 and i % 2 == 0:

#         meore.append(num1[i])

# print(pirveli)
# print(meore)





# 5) შექმენით ყველანაირი მონაცემთა ტიპების ელემენტებით სავსე სია, ამოშალეთ ყველა დუპლიკატები - ყველაფერი რაც მეორდება 2-ზე მეტჯერ, გამოიყენეთ remove() ფუნქცია და while ციკლი.

data = [True, 123.332, 123, "nika", 12312, 45.53, 12312, 12312, 45.53, "nika", "nika"]







# 6)  მომხმარებელს შემოატანინეთ წინადადება და დაპრინტეთ ამ წინადადებაში მყოფი ყველაზე გრძელი სიტყვა, გამოიყენეთ while ციკლი, არ გამოიყენოთ max() ფუნქცია.




