# print(50>23 or 20==42)
# print(21<42) or 10<3
# print(40==23 or 23<24)
# print(1334>1222 and 32==32)
# print(40==40 or 0==3)


# print(13<32 and 40==42)
# print(13==32 and 40>23)
# print(132<1444 and 1==4)
# print(13<23 and 200==233)
# print(13>23 or 0==1)






# #sequancing - წერა ზევიდან ქვევით
# #interaction - გამეორება ან გარკვეული რაოდენობით ან უსასრულოდ
# #selection - არჩევანი 


# print("nika")

# print("1.32")
# print("132")



# #ეს არის sequancing მაგალითი რადგან ეს რომ გავუშვათ ტერმინალში ჩვენ მივიგებთ თანმიმდევრობით



#for loop ჩვენ გვეხმარება გავიმეოროთ ესა თუ ის იმდენჯერ რამდენჯერაც გვინდა ხელიტ წერის ნაცვლად
i = "saba"
for i in range(10):
    print(i)