
#დღეს ჩჩვენ ვისწავლეთ ოთხი მონაცცემთა ტიპი ესენია: integer,string,fload and  boolean
#string ის არის ბრჭყალებში მოცემული ტექსტი
#მაგ"Hello World", "100"
#integer ეს არის მთელი რიცხვი
#მაგ 100 200 300 400
#float არის ათწილადი რიცხვი
#მაგ: 5.5,6.6,88.99.
#boolean მას გადაეცემა მხოლოდ True and False
print("Saba Arabuli")


print(150)

print(5.6)


print(True)

#ცვლადი არის დასახელებული ადგილი ჩვენს შემთხვევაში ყუთი სადაც ვინახავთ მონაცემებს რათა პროგრამამ გამოიყენოს ან შეცვალოს მისი მნიშვნელობა



age = 14


name = "Saba"

height = 1.83


