# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

enter = input("enter your name")

print(enter.upper())

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

enter = input("enter your name: ")

print(enter.lower())

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი
enter = input("enter your name: ")

print(enter.capitalize())

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით
 
low = ["saba", "daviti", "lasha", "malxaza"]

for i in low:
   print(i.upper())
   

#5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით

upp = ["SABA", "DAVITI", "LIZI", "LUKA"]

for i in upp:
   print(i.lower())
   

#6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს

low = ["saba", "daviti", "lasha", "malxaza"]

for i in low:
   print(i.capitalize())
   

# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

li = [4234, '342', 423.4, True]
print(len(li))

#8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს
name = "ალექსანდრე"
print(len(name))
# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

num = [23423, 324, 3422, 453455, 234324234, 4324234, 432423, 645, 547,7 ,8]

start = 0
for i in num:
    if i % 2 == 0:
        start += 1
print(start)
    

# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

num = [23423, 324, 3422, 453455, 234324234, 4324234, 432423, 645, 547,7 ,8]

start = 0
for i in num:
    if i % 2 == 1:
        start += 1
print(start)
    
# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("შეიყვანე start: "))
end = int(input("შეიყვანე end: "))
step = int(input("შეიყვანე step: "))


for i in range(start, end, step):
    if i % 2 == 0:
        print(i)