#1) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება თქენს პირველ სიაში მყოფი მხოლოდ ლუწი რიცხვები. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი

num = [123, 44, 5, 677, 88]

start = []
for i in num:
    if i % 2 == 0:
        start.append(i)
print(start)


#2) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება მხოლოდ თქენს პირველ სიაში კენტ ინდექსზე მდგომი რიცხვები რომელბიც არიან აუცილებლად კენტი. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.
num = [123, 44, 5, 677, 88, 34 , 55]

all = []

for i in range(len(num)):
    if i % 2 == 1:
        if num[i] % 2 == 1:
            all.append(num[i])

print(all)

#3) შექმენით სახელებით სავსე სია და ამ სიიდან ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება ასო გ-თი და მთავრდება ასო ი-თი, გამოიყენეთ for ციკლი, დაწერეთ ორივე ხერხით, pop() ფუნქციითაც და remove() ფუნქციითაც.


names = ["გოგა", "ლევანი", "გივი", "მარი", "გაჩი", "სანი"]

for i in names:
    if i[0] == "გ" and i[-1] == "ი":
        names.remove(i)

print(names)