#1) შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.
word = "helloworld"


xmovani = "aeiou"
finish = 0
for i in word:
    if i in xmovani:
        finish += 1
print(finish)

#2) შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.
num = [1, 2, 3, 4, 5, 6, 7, 8, 9]
result = 0
for i in num:
    if i % 2 == 0:
        result += 1

print(result)


#3) შექმენით რიცხვებით სავსე სია, გაიგეთ რომელი რიცხვი არის ამ სიაში ყველაზე დიდი, გამოიყენეთ for ციკლი, არ გამოიყენოთ max() ფუნქცია.
num = [1, 2, 3, 9, 5]

biggest = num[0]

for i in num:
    if i > biggest:
        biggest = i   

print(biggest)



#4) მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, როცა პაროლის სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" გამოიყენეთ while ციკლი.
password = input("enter you password: ")

while True:
    if len(password) < 6:
        password = input("enter you password: ")
    elif len(password) >= 6:
        break

print("your password is correct")


 
#5) შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, აუცილებლად იგივე თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.




#6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია.




#7) შექმენით რაიმე რიცხვის ცვლადი და მომხმარებელს შემოატანინეთ რიხვი, მომხმარებელმა უნდა შეეცადოს რომ გამოიცნოს ჩვენი რიცხვი, თუ მისი შემოტანილი რიცხვი არ უდრის ჩვენს რიცხვს, მაშინ ისევ თავიდან შემოატანინეთ მანამ სანამ არ გამოიცნობს. როცა ჩვენს რიცხვს გამოიცნობს, დაპრინტეთ თუ რამდენი ცდა მოუწია მანამ სანამ გამოიცნო, მაგალითად: "Correct! Attempts: 10" გამოიყენეთ while ციკლი.


num = 24

inputt = int(input("enter number to guess:  "))


i = 0

while True:
    if inputt == num:
        i += 1
        break



    elif inputt != num:
        i += 1
        inputt = int(input("enter number to guess:  "))


print("correct you took ", i, "guesses" )


