# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას კენტ ინდექსზე სიაში, გამოიყენეთ remove() ფუნქცია და for ციკლი.

list = [1, 2, 22, 4, 56, 22, 43, 8, 6745, 10]

for i in range(len(list)):
    if list[i] % 2 == 0 or i % 2 == 1:
        list.remove(list[i])

print(list)


# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.

list = ["სა" , "ბა", "არ", "აბუ", "ლი"]

for i in list[:]:

    list.append(i)

print(list)


# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

list1 = [10, 24, 30, 455, 62, 41, 654]



list2 = ["banani" ,"vashli" , "vaja"]

for i in list1:
    if i > 20 and i < 50:
        list2.append(str(i))

print(list2)


# # 4) შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for ციკლი და სტრინგის შესაბამისი ფუნქცია.

# list3 = ["lasha" , "elephant" , "vefxvi" , "lomi"]



        
        



# 5) თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი.

#append()  სიის ბოლოში ამატებს ერთ ელემენტს.
#remove()  შლის კონკრეტულ მნიშვნელობას სიიდან 
#index()  აბრუნებს კონკრეტული მნიშვნელობის ინდექსს.
#len()  აბრუნებს სიაში ელემენტების რაოდენობა
#pop()  შლის ელემენტს ინდექსით და აბრუნებს მას.
#insert()  ამატებს ელემენტს კონკრეტულ ინდექსზე
#expend()  აერთიანებს სიებს
#clear()  აცარიელებს სიას
#count()  ითვლის რამდენჯერ მეორდება კონკრეტული მნიშვნელობა
#reverse()  ატრიალებბს სიას