# 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
#    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#    თუ კენტია -> "კენტი"  
#    ფორმატით:  
#    1 კენტია  
#    2 ლუწია
  
for i in range(1, 50):

    if i % 2 == 0:
        print(i, "LUWIA")
    else:
        print(i, "kentia")







# 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
#    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
#    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
#    - სხვაგვარად -> "არ იყოფა არცერთზე"


for i in range(20):

    if i % 3 == 0 and i % 5 == 0:
        print(i, "IYOFA SAMZZE DA XUTZE")
   
    elif i % 5 == 0:
        print("iyofa xutze")
    elif  i % 3 == 0:
        print(i, "iyofa")
    else:
        print(i, "ar iyoffa arcertze")







# 3) მომხმარებელს შემოატანინე რიცხვი. 
#    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
#    დაბეჭდე შედეგი ამ ფორმატით:  
#    ლუწი რიცხვების რაოდენობა: X  
#    კენტი რიცხვების რაოდენობა: Y

enter = int(input("enter number"))

luwi = 0

kenti = 0


for i in range(enter):

    if i % 2 == 0:

        luwi += 1

    else:
        kenti += 1
print(luwi, "luwi")
print(kenti, "kenti")


# 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
#    for ციკლით დაუარე თითოეულ ელემენტს.  
#    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
#    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".


number = [10, 25, 33, 47, 80, 99]


for i in number:
    if i > 50:
        print("50 ze metia")
    elif i < 50:
        print("50 ze naklebia")
    




# 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
#    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".

sum = 0

for i in range(100):

    if i % 2 == 0:

        sum += i

print("luwi rixvebis jamia", sum)
    

    






# 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
#    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.

lisst = ["marwyvi", "alubali", "shhahkvlavi", "alberta"]


for i in lisst:

    if i[0] == "a":
        print(i)



# 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    თუ რიცხვი არის ნული -> "ნულია"  
#    თუ კენტია -> "კენტია"  
#    თუ ლუწია -> "ლუწია".


for i in range(20):

    if i == 0:
        print("nuliaa")

    elif i % 2 == 1:
        print("kentiaa")
    else:
        print("luwiaaa")

# 8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
#    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.


num = [5, 15, 25, 35, 45, 55] 

for i in num:

    if i % 5 == 0:
        print(i)


# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.
word = input("enter word")

for i in word:


    print(i)







# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".

total = 0 

for i in range(1, 10):
    
    total += i

print("jami aris", total)




